import React, { useId } from 'react'
import localFont from 'next/font/local';

import { Container } from '@/components/ui/Container'

const Badeen = localFont({
  src : [
    {
      path: '../app/fonts/BadeenDisplay-Regular.ttf',
      weight: '400',
      style: 'normal'
    }
  ]
})


type featuresType = {
  id: number;
  name: string;
  descriptionOne: string;
  descriptionTwo: string;
  descriptionThree: string;
  icon: React.ComponentType<React.SVGProps<SVGSVGElement>>;
  category: string;
}
const features: featuresType[] = [
  {
    id: 1,
    name: 'ماژول باسکول',
    descriptionOne: 'نرم‌افزار باسکول رهان یک راه‌حل جامع برای مدیریت و کنترل فرآیندهای توزین و گزارش‌گیری است.',
    descriptionTwo: 'این نرم‌افزار به‌خوبی با سیستم‌های خرید، فروش، انبار و حسابداری یکپارچه شده و امکان ردیابی دقیق معاملات را فراهم می‌آورد. همچنین، با قابلیت ارسال پیامک، کاربران می‌توانند به‌راحتی از وضعیت‌های مختلف مطلع شوند.',
    descriptionThree: 'رهان به شما کمک می‌کند تا بهره‌وری کسب‌وکار خود را افزایش دهید و مدیریت بهتری بر روی داده‌های مربوط به توزین داشته باشید.',
    icon: DeviceClockIcon,
    category: 'رهان ERP'
  },
  {
    id: 1,
    name: "ماژول حقوق دستمزد",
    descriptionOne: "نرم‌افزار حقوق و دستمزد رهان، ابزاری جامع برای مدیریت حقوق و دستمزد کارکنان است که قابلیت محاسبه انواع شیفت‌های کاری را دارد.",
    descriptionTwo: "این نرم‌افزار به گونه‌ای طراحی شده که تمامی خدمات مرتبط با پرسنل و حقوق و دستمزد را در خود جای داده و فرآیندهای اداری را به صورت خودکار انجام می‌دهد.",
    descriptionThree: "طراحی ساده و کاربرپسند آن، استفاده را برای مدیران و کارشناسان منابع انسانی آسان می‌کند و به افزایش بهره‌وری در سازمان‌ها کمک می‌نماید.",
    icon: SalaryIcon,
    category: 'رهان ERP'
  },
  {
    id: 1,
    name: "ماژول دارایی ثابت",
    descriptionOne: "نرم‌افزار دارایی ثابت رهان ، ابزاری پیشرفته و کاربرپسند است که به شما امکان مدیریت کامل دارایی‌های ثابت را می‌دهد.",
    descriptionTwo: "این نرم‌افزار نه تنها امکان صدور سند حسابداری را به سادگی فراهم می‌کند، بلکه قابلیت محاسبه استهلاک دارایی‌ها را نیز به طور دقیق انجام می‌دهد. با طراحی هوشمندانه و امکانات جامع، می‌توانید تمامی اطلاعات مربوط به دارایی‌ها را ثبت و پیگیری کرده و گزارش‌های تحلیلی دقیقی دریافت کنید.",
    descriptionThree: "این نرم‌افزار به شما کمک می‌کند تا به راحتی مدیریت مالی دارایی‌های ثابت خود را بهینه کنید و از تصمیم‌گیری‌های آگاهانه بهره‌مند شوید.",
    icon: AccountingIcon,
    category: 'رهان ERP'
  },
  {
    id: 1,
    name: "ماژول حسابداری",
    descriptionOne: "نرم‌افزار حسابداری رهان، یک راهکار جامع و یکپارچه است که به تمامی بخش‌های شرکت ارتباط برقرار می‌کند و امکان مدیریت دقیق مالی را فراهم می‌آورد.",
    descriptionTwo: "این نرم‌افزار با ارائه گزارش‌های جامع و تحلیلی، به شما کمک می‌کند تا از وضعیت مالی خود به طور کامل آگاه شوید و تصمیمات بهتری اتخاذ کنید.",
    descriptionThree: "رابط کاربری کاربرپسند رهان، این امکان را برای افراد با هر سطح دانشی فراهم می‌کند تا به سادگی از امکانات آن بهره‌مند شوند. با رهان، فرآیندهای حسابداری خود را بهینه کنید و به موفقیت بیشتری دست یابید.",
    icon: FixedAssetsIcon,
    category: 'رهان ERP'
  },
  {
    id: 1,
    name: "ماژول بازرگانی و تدارکات",
    descriptionOne: "نرم‌افزار بازرگانی و تدارکات رهان ، به طور ویژه برای کارخانجات صنعتی طراحی شده است تا تمامی عملیات‌های خرید و فروش را به بهترین شکل ممکن مدیریت کند.",
    descriptionTwo: "این نرم‌افزار با ارتباط موثر با سایر بخش‌های شرکت، به کاربران با هر سطح دانشی امکان می‌دهد به سادگی از آن استفاده کنند. با امکاناتی نظیر گزارشات جامع و نمودارهای تحلیلی، شما می‌توانید تصمیمات بهتری اتخاذ کنید و روندهای تجاری خود را بهینه‌سازی کنید.",
    descriptionThree: "این نرم‌افزار ابزاری قدرتمند برای افزایش کارایی و شفافیت در فرآیندهای بازرگانی شماست.",
    icon: BussinessIcon,
    category: 'رهان ERP'
  },
  {
    id: 1,
    name: "ماژول انبار",
    descriptionOne: "نرم‌افزار انبار رهان ، به طور خاص برای کارخانجات صنعتی طراحی شده است تا تمامی عملیات‌های مربوط به انبار را به همراه ارتباط موثر با سایر بخش‌ها مدیریت کند.",
    descriptionTwo: "این نرم‌افزار کاربرپسند به هر فرد با هر سطح دانشی این امکان را می‌دهد که به راحتی از آن استفاده کند.",
    descriptionThree: "با قابلیت‌هایی نظیر پیگیری موجودی، مدیریت ورود و خروج کالا، و هماهنگی با سیستم‌های خرید و فروش، می‌توانید فرآیندهای انبارداری را بهینه کرده و کارایی را افزایش دهید. این نرم‌افزار ابزاری مطمئن برای مدیریت دقیق و موثر انبار شماست.",
    icon: WarehouseIcon,
    category: 'رهان ERP'
  },
  // {
  //   id: 2,
  //   name: 'با رویکرد ERP',
  //   descriptionOne: '',
  //   descriptionTwo: '',
  //   descriptionThree: '',
  //   icon: DeviceClockIcon,
  //   category: 'رهان اکو'
  // },
  {
    id: 3,
    name: 'نرم افزار مدیریت طلافروشی',
    descriptionOne: 'نرم‌افزار هوشمند و یکپارچه برای مدیریت فعالیت‌های مرتبط با بازار طلا (طلافروشی، صرافی، آبشده، سکه و جواهر)',
    descriptionTwo: 'خرید و فروش، محاسبه خودکار سود و زیان بر اساس نرخ لحظه‌ای، مدیریت حساب مشتریان، کنترل موجودی و صندوق، و ارائه گزارش‌های دقیق مالی و آماری',
    descriptionThree: 'هدف آن کاهش خطاهای انسانی، افزایش سرعت و دقت معاملات، و ایجاد شفافیت در اطلاعات است. نرم‌افزار با رابط کاربری ساده و بدون نیاز به دانش حسابداری پیچیده',
    icon: GoldIcon,
    category: 'رهان استور'
  },
  {
    id: 3,
    name: 'نرم افزار مدیریت کافه، رستوران',
    descriptionOne: 'نرم‌افزار جامع مدیریت کافه و رستوران برای یکپارچه‌سازی فرآیندهای روزانه ',
    descriptionTwo: 'ثبت سفارش، مدیریت منو، موجودی انبار، تراکنش‌های مالی، پرسنل و گزارش‌گیری',
    descriptionThree: 'با هدف کاهش خطا، افزایش سرعت و شفافیت مالی، بدون نیاز به دانش حسابداری، برای انواع کسب‌وکارها با رابط کاربری مدرن و انعطاف‌پذیر ارائه می‌شود و قابلیت اجرا در پلتفرم‌های مختلف را دارد.',
    icon: RestaurantIcon,
    category: 'رهان استور'
  },
  {
    id: 3,
    name: 'نرم افزار مدیریت سالن های زیبایی',
    descriptionOne: 'نرم‌افزار مدیریت سالن‌های زیبایی و آموزشگاه‌ها، با قابلیت گروه‌بندی مشتریان.',
    descriptionTwo: 'مدیریت خدمات، نوبت‌دهی و صدور فاکتور، فرآیندهای رزرو کلاس و هماهنگی با پرسنل را ساده می‌کند.',
    descriptionThree: 'ماژول‌های مکمل شامل مدیریت انبار، خزانه و گزارش‌گیری، نیازهای مدیریتی را یکپارچه پوشش می‌دهد.',
    icon: BeautyIcon,
    category: 'رهان استور'
  },
  
]

function BussinessIcon(props: React.ComponentPropsWithoutRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" fill="#000000" {...props}>
      <g fill="#000000" fill-rule="evenodd" clip-rule="evenodd">
        <path d="M11.206 16.156a.33.33 0 0 0 .369-.31a.35.35 0 0 0-.31-.369a1.995 1.995 0 0 0-2.284 1.347c-.14.599.13 1.277 1.077 1.786a2.39 2.39 0 0 0 2.644-.509a1.566 1.566 0 0 0-.399-2.524a.39.39 0 0 0-.499.599c.37.349.43.688.27.997a1 1 0 0 1-.659.38a1.3 1.3 0 0 1-.818-.09c-.4-.16-.579-.35-.469-.589a1.26 1.26 0 0 1 1.078-.718"/>
        <path d="M12.263 13.452a8.8 8.8 0 0 1-3.641 0c-.52-.07-1.048-.12-1.567-.14a8 8 0 0 0-1.077 0c-3.582.34-3.243.579-2.634 3.801c.11.58.27 1.148.429 1.706c.24.848.529 1.666.768 2.515a.39.39 0 0 0 .46.309a3.85 3.85 0 0 1 2.663-1.088c.668-.018 1.336.025 1.995.13c.708.09 1.427.19 2.145.25a12.4 12.4 0 0 0 3.791-.36c4.28-1.157 3.512-2.304 3.452-3.172a4 4 0 0 0-.07-.569a3.6 3.6 0 0 0-.15-.539c-.159-.429-.368-.798-.548-1.207a.35.35 0 0 0-.32-.21a.34.34 0 0 0-.269.4a11 11 0 0 0 0 1.516q.058.437.19.858c.09.28.19.539.28.808a8.1 8.1 0 0 1-2.764 1.098a12 12 0 0 1-3.442.13c-.719 0-1.427-.15-2.135-.19a10 10 0 0 0-2.265.11a5.5 5.5 0 0 0-2.314.997c-.07-.648-.14-1.307-.24-1.995c-.06-.37-.13-.728-.21-1.087c-.08-.36-.179-.709-.279-1.058c-.19-.609-.409-1.197-.618-1.786a7.8 7.8 0 0 1 2.993-.14c.598.06 1.207.12 1.815.15q.966.047 1.926-.07a6.3 6.3 0 0 0 1.915-.499a.4.4 0 0 0 .22-.498a.39.39 0 0 0-.499-.17m10.685-8.221c-.3-.578-1.457-1.347-2.305-2.733a5.7 5.7 0 0 1-.768-1.996a.63.63 0 0 0-.529-.489a.6.6 0 0 0-.628.26a18 18 0 0 1-2.604 2.304a4.2 4.2 0 0 0-1.067 1.427c-.151.35-.249.72-.29 1.098a6.5 6.5 0 0 0 .08 1.566s0 .19.05.36l-.27-.16a1.8 1.8 0 0 1-.319-.35a1.6 1.6 0 0 1-.2-.439c-.099-.289-.149-.598-.229-.898a5 5 0 0 0-.15-.558a.61.61 0 0 0-.772-.374a.63.63 0 0 0-.285.194q-.255.341-.469.708a5.2 5.2 0 0 0-.489 1.337a5 5 0 0 0-.09 1.397a6.47 6.47 0 0 0 1.886 4.3a4.58 4.58 0 0 0 3.462 1.267a3 3 0 0 0 1.217.29a2.45 2.45 0 0 0 1.696-.67a.38.38 0 0 0 .47.17a5.08 5.08 0 0 0 2.992-3.441a6.27 6.27 0 0 0-.389-4.57m-.469 4.33a4.3 4.3 0 0 1-1.995 2.764a2.4 2.4 0 0 0 .062-2.08a2.37 2.37 0 0 0-1.07-1.133a.389.389 0 0 0-.379.669a1.476 1.476 0 0 1 .569 1.745a1.29 1.29 0 0 1-1.367.928a1.7 1.7 0 0 1-1.437-.758a1.33 1.33 0 0 1 0-1.556c.158-.222.371-.397.619-.509a5 5 0 0 1 .918-.31a.33.33 0 0 0 .27-.398a.34.34 0 0 0-.39-.27a5.2 5.2 0 0 0-1.417.34a2.3 2.3 0 0 0-.848.598a2.375 2.375 0 0 0-.319 2.804q.1.145.22.279a3.83 3.83 0 0 1-1.816-.998a5.46 5.46 0 0 1-1.447-3.731a4.2 4.2 0 0 1 .12-1.117c0-.13.07-.26.12-.39v.1c.146.561.468 1.06.917 1.427q.363.275.789.439s.738.21.997.27a.82.82 0 0 0 .778-.24a.9.9 0 0 0 .13-.589c0-.34-.409-1.087-.439-1.277a6 6 0 0 1-.08-.998c.013-.312.08-.619.2-.907c.184-.38.442-.719.758-.998c.609-.579 1.337-1.078 1.995-1.656q.267.666.659 1.267c.888 1.327 2.045 2.045 2.364 2.594a5.3 5.3 0 0 1 .48 3.691z"/>
        <path d="M22.06 18.85a.37.37 0 0 0 .12-.34c0-.489-.06-.998-.13-1.456c0-.2-.08-.4-.13-.599a3 3 0 0 0-.2-.579c-.179-.459-.418-.858-.638-1.297a.34.34 0 0 0-.419-.24a.33.33 0 0 0-.239.42q.018.727.11 1.447q.043.304.13.598c.05.19.13.38.199.569c.18.449.38.868.559 1.307a.36.36 0 0 0 .259.26a12.6 12.6 0 0 1-3.99 2.194c-1.452.487-2.98.703-4.51.639c-1.117 0-2.215-.29-3.322-.36a7.5 7.5 0 0 0-1.567 0a9.2 9.2 0 0 0-2.045.589c-.868.35-1.716.778-2.554 1.157c-.2-1.127-.359-2.254-.588-3.372a18 18 0 0 0-.33-1.436c-.12-.44-.25-.998-.399-1.427c-.369-1.097-.798-2.155-1.247-3.233c0 0 0-.06-.08-.09a6.7 6.7 0 0 1 2.235-.997a10.6 10.6 0 0 1 1.936-.3a13 13 0 0 1 1.995 0c.938.06 1.995.27 2.993.28a4.4 4.4 0 0 0 2.125-.449a.4.4 0 0 0 .19-.509a.39.39 0 0 0-.52-.19a3.66 3.66 0 0 1-1.745.16c-.998-.11-1.996-.419-2.903-.568a9.7 9.7 0 0 0-2.215 0q-.738.094-1.447.319a7.36 7.36 0 0 0-3.192 1.856a.34.34 0 0 0 0 .479h.05a.29.29 0 0 0-.05.299c.25 1.117.439 2.235.678 3.352c.1.479.22.948.34 1.417c.119.469.259.997.408 1.416c.33 1.088.689 2.175.998 3.273a.35.35 0 0 0 .34.259v.08a.35.35 0 0 0 .448.2c.918-.32 1.866-.729 2.824-.998a8 8 0 0 1 1.865-.36q.439-.03.878 0c1.297.09 2.564.46 3.871.51c1.68.004 3.344-.307 4.908-.918a13.5 13.5 0 0 0 4.15-2.664a.39.39 0 0 0 0-.549a.32.32 0 0 0-.149-.15"/>
      </g>
    </svg>
  )
}

function WarehouseIcon(props: React.ComponentPropsWithoutRef<'svg'>) {

  return (
    <svg viewBox="0 0 24 24" fill="#000000" {...props}>
      <g fill="none" stroke="#000000" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5">
        <path d="M.756 16.5h15.958a1.5 1.5 0 0 0 1.486-1.277l1.864-12.446A1.5 1.5 0 0 1 21.547 1.5h1.709"/>
        <path d="M3.006 7.5h4.5s.75 0 .75.75v4.5s0 .75-.75.75h-4.5s-.75 0-.75-.75v-4.5s0-.75.75-.75m6-3h6s.75 0 .75.75v7.5s0 .75-.75.75h-6s-.75 0-.75-.75v-7.5s0-.75.75-.75m-6.75 16.125a1.875 1.875 0 1 0 3.75 0a1.875 1.875 0 0 0-3.75 0m10.5 0a1.875 1.875 0 1 0 3.75 0a1.875 1.875 0 0 0-3.75 0"/>
      </g>
    </svg>
  )
}

function AccountingIcon(props: React.ComponentPropsWithRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" fill="#000000" {...props}>
      <g fill="#000000" fill-rule="evenodd" clip-rule="evenodd">
        <path d="M14.67 12.82a.39.39 0 0 0 0 .548a3.66 3.66 0 0 0 2.302.887c0 .239 0 .488.07.727a.389.389 0 0 0 .777 0v-.707a5 5 0 0 0 .777-.14a2.063 2.063 0 0 0 1.565-2.581a1.5 1.5 0 0 0-1.057-1.106a3.5 3.5 0 0 0-1.106-.09V9.102c.344.026.681.11.997.25a.35.35 0 0 0 .497-.277a.34.34 0 0 0-.178-.332a4.3 4.3 0 0 0-1.356-.448V6.84a.35.35 0 0 0-.309-.379a.34.34 0 0 0-.368.309c-.1.478-.17.997-.26 1.465a3.2 3.2 0 0 0-.757.11a1.665 1.665 0 0 0-1.335 1.993a1.4 1.4 0 0 0 .916 1.186c.283.095.58.142.877.14v.448c0 .418.08.817.13 1.226a2.6 2.6 0 0 1-1.674-.509a.39.39 0 0 0-.509-.01m3.986-1.177c.15 0 .279.06.329.23c.239.727-.349 1.136-1.057 1.325l.06-1.096v-.478q.335-.036.668.02m-2.55-1.543c-.14-.568.279-.837.787-.997c0 .16-.06.309-.08.468s0 .509-.05.758q-.169.015-.339 0c-.139 0-.279-.05-.318-.23"/>
        <path d="M22.702 6.57a59 59 0 0 0-.628-5.7a.3.3 0 0 0-.09-.16V.65a.4.4 0 0 0-.547-.079c-.34.24-.878.748-1.406 1.136c-.528.389-.259.568-1.993-1.076a5 5 0 0 0-.488-.449a.65.65 0 0 0-.598-.08a2.2 2.2 0 0 0-.808.569c-.398.408-.777.996-1.076 1.285A11 11 0 0 0 13.822.551a1.78 1.78 0 0 0-1.505-.538a1.83 1.83 0 0 0-.906.518q-.606.702-1.117 1.475c-.122.204-.29.378-.488.509c-.13-.15-.259-.36-.289-.39L7.454.353a.34.34 0 0 0-.468.01v.08a.36.36 0 0 0-.2.309c0 2.302 0 4.604.07 6.906v4.555c0 .946 0 1.883-.13 2.84a.35.35 0 0 0 .28.389a.36.36 0 0 0 .388-.29a32.6 32.6 0 0 0 .678-5.79c0-1.156 0-2.322-.11-3.478c.02-1.465-.179-2.88-.329-4.385L8.89 2.774q.248.313.528.598a.57.57 0 0 0 .459.14c.334-.063.643-.223.887-.46q.544-.534.996-1.145c.26-.29.489-.588.778-.628c.08 0 .15.05.219.1q.233.16.429.368c.578.588 1.126 1.385 1.475 1.664a.78.78 0 0 0 .926-.11l.399-.458c.289-.319.648-.916.997-1.345q.061-.087.14-.16q.044.075.109.13c.17.14.787.917 1.246 1.296c.205.19.468.306.747.329a2.17 2.17 0 0 0 1.046-.489c.38-.299.758-.667 1.097-.996c.16 1.684.269 3.338.299 4.983c0 1.873 0 3.747-.13 5.66c-.06 1.445-.12 2.92-.299 4.366c-.11.936-.307 1.86-.588 2.76a4.35 4.35 0 0 1-1.834 2.252a2.29 2.29 0 0 1-2.62.08a2.84 2.84 0 0 1-.888-1.106a7.3 7.3 0 0 1-.578-2.272a.4.4 0 0 0-.428-.35a.37.37 0 0 0-.23.12q.243-.252.509-.478a.388.388 0 1 0-.459-.618c-.388.26-.996.857-1.544 1.236l-.26.18a3 3 0 0 0-.428-.35a20 20 0 0 0-1.644-1.634a1.5 1.5 0 0 0-.937-.339a1.66 1.66 0 0 0-.857.449q-.616.654-1.107 1.405c-.239-.26-.518-.678-.817-.997a1.9 1.9 0 0 0-.757-.498a.65.65 0 0 0-.548.08a4 4 0 0 0-.439.408L3.657 18.4l-.18-.1l-1.853-1.345a.32.32 0 0 0-.409.06h-.05a.33.33 0 0 0-.08.19l.11 2.74a4.18 4.18 0 0 0 1.994 3.259a6.07 6.07 0 0 0 3.687.758c.548-.05 1.585-.07 2.8-.11a147 147 0 0 0 4.286-.23c1.6-.13 3.191-.36 4.764-.687a5.6 5.6 0 0 0 3.209-3.13c.335-.97.568-1.971.697-2.99q.266-2.234.28-4.484c.02-1.963-.07-3.857-.21-5.76m-7.744 16.016h-5.69c-1.066 0-1.993 0-2.482.06a5 5 0 0 1-2.99-.469a3.25 3.25 0 0 1-1.684-2.322l-.219-1.813l.07.06c.339.298.658.607.996.916c0 0 .29.31.399.409a.49.49 0 0 0 .478.11c.221-.083.42-.216.578-.39c.4-.378.897-1.076 1.186-1.305l.997 1.136s.28.28.389.38a.76.76 0 0 0 .996 0c.2-.2.668-.888 1.146-1.446a3.6 3.6 0 0 1 .419-.438a.3.3 0 0 0 .07-.08c.633.438 1.224.936 1.764 1.485q.268.276.568.518c.113.088.255.13.398.12c.37-.083.713-.258.997-.509c.299-.249.598-.548.887-.827a.36.36 0 0 0-.08.27a8.2 8.2 0 0 0 .558 2.56a3.8 3.8 0 0 0 1.127 1.495l.1.07c-.42-.01-.698.01-.977.01"/>
        <path d="M11.85 5.166q-.52-.112-1.047-.17h-.459a2.4 2.4 0 0 0-.468 0q-.52.158-.997.419a.349.349 0 0 0 .1.667c.349 0 .658.11.997.14h.418l.429-.05l.996-.23a.38.38 0 0 0 .399-.378a.4.4 0 0 0-.369-.399m-.996 2.193a3.4 3.4 0 0 0-.559 0a12 12 0 0 0-1.315.399a.34.34 0 1 0 .05.677c.438.07.837.17 1.285.22q.264.015.529 0q.269.023.538 0c.438-.06.847-.15 1.275-.23a.388.388 0 1 0 0-.767c-.428-.09-.847-.18-1.285-.23a5 5 0 0 0-.519-.069"/>
      </g>
    </svg>
  )
}

function FixedAssetsIcon(props: React.ComponentPropsWithRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" fill="#000000" {...props}>
      <g fill="#000000" fill-rule="evenodd" clip-rule="evenodd">
        <path d="M17.478 17.629q-.264.027-.52.1a1.57 1.57 0 0 0-.648-1.758a1.42 1.42 0 0 0-1.997.22a4.4 4.4 0 0 1-1.439 1.278a7.3 7.3 0 0 1-1.807.699c-.39-.05-.749-.11-.999-.17v-.1a1.3 1.3 0 0 1-.06-.3a6 6 0 0 0-.29-1.507a1.16 1.16 0 0 0-.708-.62a1 1 0 0 0-1.188.1c-.25.285-.422.63-.5 1c-.024.243-.11.477-.25.678a1.7 1.7 0 0 1-.539.3c-.459.17-.998.27-1.418.41a2.4 2.4 0 0 1-.509-.45c.11-.28.5-.72.6-.919l.08-.15a.5.5 0 0 0 0-.14c0-.349-.18-.439-.35-.449a4 4 0 0 0-1.029.12c-.779.15-1.588.44-2.277.57a.29.29 0 0 0-.23.319a.28.28 0 0 0 .32.23c.7-.12 1.518-.33 2.297-.42h.24c-.17.29-.37.61-.45.789a.64.64 0 0 0 0 .59c.205.299.458.562.75.778c.283.21.592.384.918.52c0 0 .23 0 .41.06v.1c-.17.189-.37.398-.52.578c-.147.17-.25.371-.3.59c0 .08.24 1.398.37 2.216a9 9 0 0 0-1.997-.649c-.34 0-.62-.06-.87-.07q-.952.052-1.906 0a.34.34 0 0 0-.35.29a.33.33 0 0 0 .28.35c.898.11 1.358.06 1.937.11q.389.024.769.11a14 14 0 0 1 2.247.928a.8.8 0 0 0 .659-.07a.48.48 0 0 0 .21-.35q.015-.18 0-.36c0-.229-.07-.578-.12-.938c1.677.06 3.884.18 5.682.19c.947.035 1.895-.039 2.826-.22a8.6 8.6 0 0 0 2.716-1.328a2.86 2.86 0 0 0 1.198-1.917a1.28 1.28 0 0 0-.23-.949a1.07 1.07 0 0 0-1.008-.39m-3.815.42a5.3 5.3 0 0 0 1.458-1.19c.17-.199.41-.129.6 0a1 1 0 0 1 .309.32c0 .09.1.18.06.27c-.102.265-.27.499-.49.679a.5.5 0 0 1-.1.06l-.329.08c-.705.092-1.417.12-2.127.08q.32-.129.62-.3m3.206 1.996c-.706.542-1.5.957-2.347 1.229c-.841.196-1.702.297-2.566.3c-1.818.07-4.075 0-5.752.05c-.06-.36-.11-.67-.12-.78s.18-.24.31-.38q.338-.329.559-.748a.9.9 0 0 0 0-.829a.63.63 0 0 0-.3-.28a3.4 3.4 0 0 0-.639-.2q.38-.065.749-.18c.278-.085.538-.22.769-.398c.167-.152.29-.345.36-.56q.149-.512.369-.998c.08-.13.21-.17.42-.07s.249.41.289.699q.032.628.14 1.248a1 1 0 0 0 .679.749c.901.219 1.82.36 2.746.42c.933.096 1.873.096 2.806 0c.63-.11 1.228-.39 1.847-.54q.193-.05.39-.07h.05v.16c-.09.476-.363.899-.76 1.178m-8.938-8.386a1 1 0 0 0 0 .25v.609a.31.31 0 0 0 .08.46a.31.31 0 0 0 .41-.18a4 4 0 0 0 .39-.5q.08-.151.119-.32a1 1 0 0 0 .08-.219a.5.5 0 0 0 0-.12c.36.06.728.06 1.088 0a1.57 1.57 0 0 0 1.448-1.338a1.34 1.34 0 0 0-.41-1.168a4.5 4.5 0 0 0-1.647-.76a2.5 2.5 0 0 1-.599-.269a.41.41 0 0 1-.22-.29c-.06-.499.31-.699.75-.738a3.1 3.1 0 0 1 1.587.399a.28.28 0 0 0 .38-.08a.26.26 0 0 0-.04-.41a3 3 0 0 0-.83-.419a1 1 0 0 0 .08-.1q.065-.11.11-.23c0-.08 0-.16.05-.249c.05-.09 0-.4 0-.61a.32.32 0 1 0-.589-.229a4 4 0 0 0-.39.5a1.3 1.3 0 0 0-.119.24a1 1 0 0 0-.06.459q-.36-.045-.719 0a1.36 1.36 0 0 0-1.168 1.547a1.33 1.33 0 0 0 .559 1.089a7 7 0 0 0 1.598.689c.33.12.659.21.629.58c-.03.369-.46.548-.909.598a3 3 0 0 1-1.578-.32a1.2 1.2 0 0 1-.35-.319a3.5 3.5 0 0 1-.259-.47a.32.32 0 0 0-.39-.169a.32.32 0 0 0-.16.42q.136.381.36.718q.175.252.43.42q.213.155.46.25a1 1 0 0 0-.17.28"/>
        <path d="M8.081 3.299a5.99 5.99 0 0 0-4.573 3.685a5.21 5.21 0 0 0 1.198 5.911q.438.427.929.79a5 5 0 0 0 1.088.598c.452.168.927.265 1.408.29c.695.027 1.391-.016 2.077-.13a.28.28 0 0 0 .23-.31a.27.27 0 0 0-.31-.239a9.6 9.6 0 0 1-1.937 0a4.6 4.6 0 0 1-1.178-.32a4.4 4.4 0 0 1-.909-.599a7 7 0 0 1-.779-.759a4.39 4.39 0 0 1-.849-4.903a5.68 5.68 0 0 1 3.995-3.285a5.73 5.73 0 0 1 3.305.36c.944.272 1.761.87 2.307 1.687c.22.21.579 0 .549-.35C12.685 2.61 8.82 3.17 8.082 3.3m6.071 7.678c-.15.26-.31.5-.48.739c-.17.24-.36.46-.559.67a4.55 4.55 0 0 1-1.688 1.167a.3.3 0 0 0-.22.38a.31.31 0 0 0 .39.22a4.84 4.84 0 0 0 2.936-1.808q.32-.424.52-.919c.211-.505.34-1.041.379-1.587l-.65-.28q-.234.744-.628 1.418"/>
        <path d="M23.09 6.624a.31.31 0 0 0-.43.12a2 2 0 0 1-.549.61a1.85 1.85 0 0 1-.739.329q-.195.022-.389 0a11.4 11.4 0 0 0-1.997-.24c-.74.09-1.997.869-3.066 1.059a1 1 0 0 1-1.258-.52c-.17-.32.13-.47.43-.669c.738-.48 1.767-.938 2.166-1.647a1.54 1.54 0 0 0 .12-1.389c-.42-1.188-1.148-1.517-1.897-1.398a2.4 2.4 0 0 0-1.758 1.109a.3.3 0 0 0 .13.503a.3.3 0 0 0 .33-.124c.24-.338.595-.579.998-.679c.56-.22 1.109 0 1.358.83c.16.578-.29.848-.729 1.167c-.858.64-1.078.46-1.877 1.199a1.18 1.18 0 0 0-.21 1.568c.75 1.328 2.367 1.218 3.755.559a8.5 8.5 0 0 1 1.618-.71q.955-.009 1.897.15q.294.005.58-.07c.366-.087.708-.258.998-.499a2.5 2.5 0 0 0 .689-.828a.31.31 0 0 0-.17-.43"/>
        <path d="M23.51 3.848L20.993 2.51c-.719-.44-1.398-1.079-2.117-1.588a5.1 5.1 0 0 0-1.758-.859a3.45 3.45 0 0 0-3.145.999a9.8 9.8 0 0 0-1.418 1.718c-.34.529.17.798.53.419q.692-.77 1.467-1.458a2.6 2.6 0 0 1 2.337-.66a5.6 5.6 0 0 1 1.787.91q.925.682 1.918 1.258l2.646 1.168a.32.32 0 0 0 .42-.14a.33.33 0 0 0-.15-.429"/>
      </g>
    </svg>
  )
}

function SalaryIcon(props: React.ComponentPropsWithRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" fill="#000000" {...props}>
      <g fill="#000000" fill-rule="evenodd" clip-rule="evenodd">
        <path d="M15.26 8.976a2 2 0 0 0-.06.25v.609a.3.3 0 0 0 .17.399a.3.3 0 0 0 .4-.17q.21-.24.389-.509a1 1 0 0 0 .18-.49a.5.5 0 0 0 0-.119c.363.06.734.06 1.098 0a1.56 1.56 0 0 0 1.438-1.338a1.29 1.29 0 0 0-.4-1.148a4.35 4.35 0 0 0-1.647-.769a3 3 0 0 1-.6-.26a.42.42 0 0 1-.219-.309c-.06-.5.31-.709.759-.749c.57-.021 1.135.11 1.637.38a.27.27 0 0 0 .38-.07a.28.28 0 0 0-.08-.38a3.3 3.3 0 0 0-.839-.419a1 1 0 0 0 .08-.1q.05-.126.08-.26a2 2 0 0 0 0-.239v-.609a.3.3 0 0 0-.17-.4a.3.3 0 0 0-.4.17q-.21.237-.389.5a1.3 1.3 0 0 0-.04.24a1.3 1.3 0 0 0-.06.249a2 2 0 0 0 0 .22a2.5 2.5 0 0 0-.718 0a1.36 1.36 0 0 0-1.218 1.517a1.29 1.29 0 0 0 .559.998a6.3 6.3 0 0 0 1.597.7c.33.12.67.209.64.578c-.03.37-.47.57-.93.61a2.84 2.84 0 0 1-1.577-.29a1.2 1.2 0 0 1-.29-.28a2.5 2.5 0 0 1-.319-.509a.31.31 0 0 0-.4-.16a.31.31 0 0 0-.159.41q.135.381.36.719c.114.166.26.308.429.419q.215.154.46.26v.05a1 1 0 0 0-.14.299"/>
        <path d="M22.699 3.425A6.38 6.38 0 0 0 19.514.649A7.2 7.2 0 0 0 15.33.1a7.16 7.16 0 0 0-5.141 4.183a5.68 5.68 0 0 0 1.287 6.38q.466.473.999.869q.539.408 1.168.659c.486.186.998.294 1.518.32c.754.04 1.51 0 2.256-.12a.27.27 0 0 0 .24-.3a.28.28 0 0 0-.3-.24c-.71.08-1.427.08-2.137 0a4.6 4.6 0 0 1-1.327-.33a4 4 0 0 1-.999-.608a8 8 0 0 1-.888-.819a4.89 4.89 0 0 1-.939-5.471a6.2 6.2 0 0 1 4.453-3.554a6.35 6.35 0 0 1 3.594.449a5.5 5.5 0 0 1 2.766 2.286a5.37 5.37 0 0 1 .19 4.513a5.22 5.22 0 0 1-3.305 3.145a.32.32 0 0 0-.22.38a.32.32 0 0 0 .39.219a5.93 5.93 0 0 0 3.833-3.454a6.22 6.22 0 0 0-.07-5.182M3.35 10.184q.167.4.379.779c.112.177.266.325.45.43a.57.57 0 0 0 .488 0a6 6 0 0 0 .819-.55c.34-.27.679-.57.998-.869c.32-.3.63-.619.919-.928a.31.31 0 0 0-.331-.507a.3.3 0 0 0-.098.068a15.6 15.6 0 0 1-1.857 1.348q.383-1.027.928-1.977c.307-.564.664-1.1 1.068-1.598A5.5 5.5 0 0 1 9.56 4.513a.26.26 0 0 0 .19-.33a.26.26 0 0 0-.33-.2a5.53 5.53 0 0 0-3.084 1.728a7.3 7.3 0 0 0-1.159 1.777a11.3 11.3 0 0 0-.798 2.536q-.03-.145-.09-.28q-.405-.766-.689-1.587q-.3-.83-.47-1.697a.271.271 0 1 0-.538.06c.017.75.114 1.497.29 2.226q.182.736.468 1.438m13.308 6.02a10 10 0 0 0-.31-2.236a.75.75 0 0 0-.608-.42c-.6-.1-2.137-.17-2.307-.19c-.808-.089-1.607-.149-2.416-.209s-1.617-.08-2.426-.1H5.686c-1.438.08-2.876.21-4.313.33a.31.31 0 0 0 0 .619c1.437-.09 2.865-.2 4.303-.24H8.52c.949 0 1.598.09 2.396.16c.799.07 1.578.15 2.366.26c.16 0 1.548.11 2.177.22a9 9 0 0 1 .16 1.657c-1.578-.21-3.205-.42-4.852-.52a32 32 0 0 0-3.545 0a27.3 27.3 0 0 0-5.61.87v-1.998a.28.28 0 0 0-.27-.28a.28.28 0 0 0-.28.27l-.19 5.99c0 .37-.16 1.089-.17 1.678a2 2 0 0 0 .16.899c.205.227.485.372.79.409a34 34 0 0 0 5.39.58c2.536.079 5.312.059 7.08-.06a6.3 6.3 0 0 0 1.996-.34a1.44 1.44 0 0 0 .53-.999q.11-1.497 0-2.995c-.03-1.078.05-2.236.01-3.355m-1.128 6.25a.7.7 0 0 1-.05.17q-.576.135-1.168.16c-1.398.12-3.604.18-5.8.18a51 51 0 0 1-6.46-.28c-.21 0-.38-.17-.45-.14a2.1 2.1 0 0 1-.05-.649c0-.539.12-1.118.12-1.437V18.76a.3.3 0 0 0 .13 0c.898 0 1.787-.06 2.676-.06H8.72c2.146 0 4.283 0 6.44.07a.31.31 0 0 0 .329-.29a.3.3 0 0 0-.28-.329c-1.577-.17-3.145-.33-4.712-.419c-.679 0-1.358-.07-1.997-.07H6.504c-1.577.08-3.145.26-4.722.48h-.07v-1.179a36 36 0 0 1 5.661-.42h3.464c1.658 0 3.305.09 4.903.19c0 .949-.07 1.897-.08 2.736v1.827a5 5 0 0 1-.13 1.158"/>
        <path d="M13.773 20.957a7 7 0 0 0-.809-.35q-.184-.06-.38-.06a1.8 1.8 0 0 0-.399 0a2.5 2.5 0 0 0-.918.32a.31.31 0 1 0 .2.59q.377-.01.748.069q.259.04.52.05c.329 0 .638-.07.998-.1a.27.27 0 0 0 .304-.336a.27.27 0 0 0-.224-.203z"/>
      </g>
    </svg>
  )
}

function DeviceClockIcon(props: React.ComponentPropsWithoutRef<'svg'>) {
  return (
    <svg viewBox="0 0 32 32" aria-hidden="true" {...props}>
      <circle cx={16} cy={16} r={16} fill="#A3A3A3" fillOpacity={0.2} />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M5 4a4 4 0 014-4h14a4 4 0 014 4v10h-2V4a2 2 0 00-2-2h-1.382a1 1 0 00-.894.553l-.448.894a1 1 0 01-.894.553h-6.764a1 1 0 01-.894-.553l-.448-.894A1 1 0 0010.382 2H9a2 2 0 00-2 2v24a2 2 0 002 2h5v2H9a4 4 0 01-4-4V4z"
        fill="#737373"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M24 32a8 8 0 100-16 8 8 0 000 16zm1-8.414V19h-2v5.414l4 4L28.414 27 25 23.586z"
        fill="#171717"
      />
    </svg>
  )
}

function BeautyIcon(props: React.ComponentPropsWithoutRef<'svg'>) {
  return (
    <svg viewBox="0 0 32 32" {...props}>
      <path 
        fill="#000000" 
        d="M28.185 24.38h-9.14v-1.52h-1.52V32h12.19v-9.14h-1.53zm-4.57-19.81h3.05V6.1h-3.05Zm0 6.1h1.53v3.05h-1.53Zm-1.52-4.57h1.52v1.52h-1.52Z"/>
      <path 
        fill="#000000" 
        d="M28.185 22.86V6.1h-1.52v10.67h-6.1V9.15h-1.52v13.71Zm-7.62-4.57h6.1v3.05h-6.1Z"/>
      <path 
        fill="#000000" 
        d="M20.565 7.62h1.53v1.53h-1.53ZM3.805 0v1.53h-1.52V32h12.19V1.53h-1.52V0Zm9.15 24.38h-9.15v-1.52h9.15Zm0-3.04h-9.15v-3.05h9.15Zm0-12.19h-1.53V4.57h-3.05V3.05h3.05v1.52h1.53Z"/>
    </svg>
  )
}

function RestaurantIcon(props: React.ComponentPropsWithoutRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" {...props}>
      <path 
        fill="none" 
        stroke="#000000" 
        stroke-linecap="round" 
        stroke-linejoin="round" 
        stroke-width="1.5" 
        d="M3 12v5m0 0h2c1.414 0 2.121 0 2.56.44C8 17.878 8 18.585 8 20v1m-5-4v4M4 7l5.317-2.917C10.633 3.361 11.292 3 12 3s1.367.361 2.683 1.083L20 7m-2-1v4M6 6v4m15 2v5m0 0h-2c-1.414 0-2.121 0-2.56.44C16 17.878 16 18.585 16 20v1m5-4v4M7 14h5m5 0h-5m0 0v7m0 0h-1m1 0h1" 
        color="currentColor"/>
    </svg>
  )
}

function GoldIcon(props: React.ComponentPropsWithoutRef<'svg'>) {
  return (
    <svg viewBox="0 0 24 24" {...props}>
      <path 
        fill="none" 
        stroke="#000000" 
        stroke-linecap="round" 
        stroke-linejoin="round" 
        stroke-width="1.5" 
        d="M14.265 18.372c.316-.965.474-1.447.797-1.779q.231-.238.527-.386C16 16 16.5 16 17.5 16s1.5 0 1.912.207q.294.148.527.386c.323.332.48.814.797 1.779l.326.995c.394 1.202.591 1.802.297 2.218c-.295.415-.917.415-2.162.415h-3.393c-1.245 0-1.868 0-2.162-.415c-.295-.416-.098-1.016.296-2.218zm-5.501-8c.316-.965.475-1.447.797-1.779q.233-.238.527-.386C10.5 8 11 8 12 8s1.5 0 1.912.207q.294.148.527.386c.322.332.48.814.797 1.779l.326.995c.394 1.202.59 1.802.297 2.218c-.295.415-.917.415-2.163.415h-3.392c-1.246 0-1.868 0-2.162-.415c-.295-.416-.098-1.016.296-2.218zm-5.5 8c.317-.965.475-1.447.798-1.779q.231-.238.527-.386C5 16 5.5 16 6.5 16s1.5 0 1.912.207q.294.148.527.386c.323.332.48.814.797 1.779l.326.995c.394 1.202.591 1.802.297 2.218c-.295.415-.917.415-2.162.415H4.804c-1.245 0-1.868 0-2.162-.415c-.295-.416-.098-1.016.296-2.218zM12 2v2m-4.5-.5L9 5m7.5-1.5L15 5" 
        color="currentColor"/>
    </svg>
  )
}

export default function SecondaryFeatures() {
  const groupedFeatures = features.reduce((acc: Record<string, featuresType[]>, feature) => {
  const cat = feature.category
  if (!acc[cat]) acc[cat] = []
  acc[cat].push(feature)
  return acc
  }, {} as Record<string, featuresType[]>)


  return (
    <section
      id="service"
      aria-label="Features of Rahaan Product"
      className="py-20 sm:py-32"
    >
      <Container>
        <div className="mx-auto max-w-2xl sm:text-center space-y-4">
          <h2 className="text-3xl lg:text-5xl/snug text-gray-900">
            ما حساب‌ها رو ساده می‌کنیم تا شما وقت بیشتری برای رشد داشته باشید.
          </h2>
          <p className="mt-2 text-sm text-gray-600">
            از نرم‌افزارهای فروشگاهی تا ERP کامل شرکتی — هر ابزاری که برای مدیریت بهتر کارتون نیاز دارید اینجاست.
          </p>
        </div>
        {Object.keys(groupedFeatures).map((category) =>
          <div key={category} className='mt-10'>
            <h3 className={`${Badeen.className} text-3xl m-4`}>
              {category}
            </h3>
            <ul
              role='list'
              className='mx-auto grid max-w-2xl grid-cols-1 gap-6 text-sm sm:grid-cols-2 md:gap-y-10 lg:max-w-none lg:grid-cols-3'
            >
              {groupedFeatures[category].map((feature) =>
              (
                <li
                  key={feature.name}
                  className='rounded-2xl border border-gray-200 p-8 flex flex-col space-y-6'
                >
                  <feature.icon className="h-8 w-8" />
                  <h4 className={`bg-accent tracking-tighter text-[17px] py-2 px-4 rounded-lg`}>
                    {feature.name}
                  </h4>
                  <ul className='text-xs list-disc space-y-2'>
                    <li className='text-gray-700'>{feature.descriptionOne}</li>
                    <li className='text-gray-700'>{feature.descriptionTwo}</li>
                    <li className='text-gray-700'>{feature.descriptionThree}</li>
                  </ul>
                </li>
              ))}
            </ul>
          </div>
        )}
      </Container>
    </section>
  )
}
